Autodesk.Revit.DB.ExternalResourceSubFolder.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalResourceSubFolder.IconPath
The path of the resource icon.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019.1

Autodesk.Revit.DB.ExternalResourceSubFolder.FolderName
Folder displayed name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019.1

Autodesk.Revit.DB.ExternalResourceSubFolder.#ctor(System.String,System.String)
Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path.
folderName:
Folder displayed name.
iconPath:
The path of the resource icon.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019.1

Autodesk.Revit.DB.ExternalResourceSubFolder.#ctor
Constructs a new ExternalResourceSubFolder with default values for folder name and icon path.
Since:
2019.1

Autodesk.Revit.DB.ExternalResourceSubFolder
Data that describes a remote folder to be shown in the file browser dialog
Since:
2019.1